# **What is Pandas?**

Pandas is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool,
built on top of the Python programming language.

In [107]:
# using pandas
import pandas as pd
import numpy as np
from io import StringIO

**Data Frame and Data Series**

In [108]:
df = pd.DataFrame(
    np.arange(0, 20).reshape(5, 4),
    index=['row1', 'row2', 'row3', 'row4', 'row5'],
    columns=['col1', 'col2', 'col3', 'col4']
)

In [109]:
df.head()

      col1  col2  col3  col4
row1     0     1     2     3
row2     4     5     6     7
row3     8     9    10    11
row4    12    13    14    15
row5    16    17    18    19

In [110]:
# export dataframe as csv file
df.to_csv('sample_dataframe_export_as_csv.csv')

In [111]:
#access of dataframe

df.loc['row2']  # Access by label
df.iloc[2]     # Access by position

col1     8
col2     9
col3    10
col4    11
Name: row3, dtype: int64

In [112]:
print(type(df.loc['row2']))  # pandas Series
print(type(df.iloc[2]))     # pandas Series
print(type(df))

<class 'pandas.core.series.Series'>
<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [113]:
df['col3']  # Access a column
df[['col2', 'col4']]  # Access multiple columns

      col2  col4
row1     1     3
row2     5     7
row3     9    11
row4    13    15
row5    17    19

In [114]:
#convert dataframe to array
df.values  # Convert entire DataFrame to NumPy array
# df.iloc[:, :].values  # Convert entire DataFrame to NumPy array

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [115]:
#null checking
df.isnull()  # Check for null values in the DataFrame
df.isnull().sum()  # Count of null values in each column

col1    0
col2    0
col3    0
col4    0
dtype: int64

In [116]:
#read csv file
csvdf = pd.read_csv('.\\sample_customers.csv')
csvdf.head()

,Index,Customer Id,First Name,Last Name,Company,City,Country,Phone 1,Phone 2,Email,Subscription Date,Website
0,1,DD37Cf93aecA6Dc,Sheryl,Baxter,Rasmussen Group,East Leonard,Chile,229.077.5154,397.884.0519x718,zunigavanessa@smith.info,2020-08-24,http://www.stephenson.com/
1,2,1Ef7b82A4CAAD10,Preston,Lozano,Vega-Gentry,East Jimmychester,Djibouti,5153435776,686-620-1820x944,vmata@colon.com,2021-04-23,http://www.hobbs.com/
2,3,6F94879bDAfE5a6,Roy,Berry,Murillo-Perry,Isabelborough,Antigua and Barbuda,+1-539-402-0259,(496)978-3969x58947,beckycarr@hogan.com,2020-03-25,http://www.lawrence.com/
3,4,5Cef8BFA16c5e3c,Linda,Olsen,"Dominguez, Mcmillan and Donovan",Bensonview,Dominican Republic,001-808-617-6467x12895,+1-813-324-8756,stanleyblackwell@benson.org,2020-06-02,http://www.good-lyons.com/
4,5,053d585Ab6b3159,Joanna,Bender,"Martin, Lang and Andrade",West Priscilla,Slovakia (Slovak Republic),001-234-203-0635x76146,001-199-446-3860x3486,colinalvarado@miles.net,2021-04-17,https://goodwin-ingram.com/

In [117]:
# sample data

data = (
    'index,col1,col2,col3\n'
    '1,Apple,2,75\n'
    '2,Grapes,5,60\n'
    '3,Sapota,4,90\n'
    '4,Lemon,10,120\n'
    '5,Avacado,1,150\n'
    )

In [118]:
pd.read_csv(StringIO(data))

#output1
# index	col1	col2	col3
# 0	Apple	2	75	NaN
# 1	Grapes	5	60	NaN
# 2	Sapota	4	90	NaN
# 3	Lemon	10	120	NaN
# 4	Avacado	1	150	NaN


pd.read_csv(StringIO(data), index_col=0)

#output2
#         col1	col2	col3
# index			
# 1	    Apple	2   	75
# 2	    Grapes	5   	60
# 3	    Sapota	4   	90
# 4	    Lemon	10  	120
# 5	    Avacado	1   	150

pd.read_csv(StringIO(data), index_col=False)

#Output3
#    index	    col1	col2	col3
pd.read_csv(StringIO(data))

#output1
# index	col1	col2	col3
# 0	Apple	2	75	NaN
# 1	Grapes	5	60	NaN
# 2	Sapota	4	90	NaN
# 3	Lemon	10	120	NaN
# 4	Avacado	1	150	NaN


pd.read_csv(StringIO(data), index_col=0)

#output2
#         col1	col2	col3
# index			
# 1	    Apple	2   	75
# 2	    Grapes	5   	60
# 3	    Sapota	4   	90
# 4	    Lemon	10  	120
# 5	    Avacado	1   	150

pd.read_csv(StringIO(data), index_col=False)

#Output3
#    index	    col1	col2	col3
pd.read_csv(StringIO(data))

#output1
# index	col1	col2	col3
# 0	Apple	2	75	NaN
# 1	Grapes	5	60	NaN
# 2	Sapota	4	90	NaN
# 3	Lemon	10	120	NaN
# 4	Avacado	1	150	NaN


pd.read_csv(StringIO(data), index_col=0)

#output2
#         col1	col2	col3
# index			
# 1	    Apple	2   	75
# 2	    Grapes	5   	60
# 3	    Sapota	4   	90
# 4	    Lemon	10  	120
# 5	    Avacado	1   	150

pd.read_csv(StringIO(data), index_col=False)

#Output3

#   index	col1	col2	col3
# 0	 1	    Apple	2	    75
# 1	 2	    Grapes	5	    60
# 2	 3	    Sapota	4	    90
# 3	 4	    Lemon	10	    120
# 4	 5	    Avacado	1	    150

   index     col1  col2  col3
0      1    Apple     2    75
1      2   Grapes     5    60
2      3   Sapota     4    90
3      4    Lemon    10   120
4      5  Avacado     1   150

In [119]:
pd.read_csv(StringIO(data), usecols=['col1', 'col3'], index_col=False)

      col1  col3
0    Apple    75
1   Grapes    60
2   Sapota    90
3    Lemon   120
4  Avacado   150

In [120]:
## URL TO CSV Conversion
url = 'https://people.sc.fsu.edu/~jburkardt/data/csv/hw_200.csv'
df = pd.read_csv(url)   # Read CSV from URL wihout downloading file
df.head()

   Index   Height(Inches)"   "Weight(Pounds)"
0      1             65.78             112.99
1      2             71.52             136.49
2      3             69.40             153.03
3      4             68.22             142.34
4      5             67.79             144.30

In [121]:
#Read HTML content
url = 'https://datatables.net/examples/data_sources/dom.html'
html_tables = pd.read_html(url)

html_tables[0].head()  # First table from the list of tables

,Name,Position,Office,Age,Start date,Salary
0,Tiger Nixon,System Architect,Edinburgh,61,2011-04-25,"$320,800"
1,Garrett Winters,Accountant,Tokyo,63,2011-07-25,"$170,750"
2,Ashton Cox,Junior Technical Author,San Francisco,66,2009-01-12,"$86,000"
3,Cedric Kelly,Senior JavaScript Developer,Edinburgh,22,2012-03-29,"$433,060"
4,Airi Satou,Accountant,Tokyo,33,2008-11-28,"$162,700"

In [122]:
#Read HTML content
url = 'https://www.mlb.com/standings/'
html_tables = pd.read_html(url)

res = [html_tables[i].head(3) for i in range(len(html_tables))]  # First table from the list of tables
print(res)

[              AL East   W   L   PCT   GB  WCGB  L10 STRK   RS   RA  DIFF  \
0  Toronto Blue Jaysz  94  68  .580    -     -  5-5   W4  798  721   +77
1   New York Yankeesw  94  68  .580    -     -  9-1   W8  849  685  +164
2     Boston Red Soxw  89  73  .549  5.0  +2.0  6-4   W1  786  676  +110

   X-W/L   HOME   AWAY  >.500
0  88-74  54-27  40-41  49-41
1  97-65  50-31  44-37  45-44
2  92-70  48-33  41-40  44-43  ]

In [123]:
#Read Excel content
exceldf = pd.read_excel('.\\ExcelDataset.xlsx', sheet_name='Cleaned & Formatted Data')
exceldf.head()
exceldf.tail()

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Age Brackets,Purchased Bike,Date Purchased
995,29337,Single,Male,30000,2,Partial College,Clerical,Yes,2,5-10 Miles,Pacific,68,Old,No,2021-07-14
996,29355,Married,Female,40000,0,Graduate Degree,Clerical,Yes,0,0-1 Miles,Europe,37,Middle-Age,Yes,2021-07-14
997,29380,Married,Female,20000,3,High School,Manual,Yes,0,0-1 Miles,Europe,41,Middle-Age,Yes,2021-07-14
998,29424,Married,Male,10000,0,Partial High School,Manual,Yes,2,0-1 Miles,Europe,32,Middle-Age,No,2021-07-14
999,29447,Single,Female,10000,2,Bachelors,Clerical,No,1,2-5 Miles,Europe,68,Old,No,2021-07-14

**Pickling**
All pandas objects are equipped with to_pickle methods which use Python's cPickle module to save data structures to disk using pickle format.

In [127]:
exceldf.to_pickle('excels_to_pickles.pkl') # convert excel to pickle file with given name

In [129]:
df_pickle = pd.read_pickle('excels_to_pickles.pkl')
df_pickle.head()

,ID,Marital Status,Gender,Income,Children,Education,Occupation,Home Owner,Cars,Commute Distance,Region,Age,Age Brackets,Purchased Bike,Date Purchased
0,11434,Married,Male,170000,5,Partial College,Professional,Yes,0,0-1 Miles,Europe,55,Old,No,2007-09-01
1,12590,Single,Male,30000,1,Bachelors,Clerical,Yes,0,0-1 Miles,Europe,63,Old,No,2021-07-14
2,12610,Married,Female,30000,1,Bachelors,Clerical,Yes,0,0-1 Miles,Europe,47,Middle-Age,No,2021-07-14
3,12697,Single,Female,90000,0,Bachelors,Professional,No,4,More than 10 Miles,Pacific,36,Middle-Age,No,2009-09-07
4,13507,Married,Female,10000,2,Partial College,Manual,Yes,0,1-2 Miles,Europe,50,Middle-Age,No,2005-08-06